////Copyright (c), Semeniuta Diana 202 TN, 2022

/*Функція з'ясовує, чи є рік високосний. Високосность визначається в
такий спосіб : якщо номер року не ділиться на 100, те високосним уважається
той, який ділиться на 4 без залишку; якщо номер року ділиться на 100, то номер
високосного року ділиться на 400 без залишку.*/

#include <iostream>
#include <Windows.h>
using namespace std;

int year(int y);
int main()
{

	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	int year(); {


		try {
			int y;
			cout << "Введіть рік" << endl;
			cin >> y;
			if (y % 4 == 0) //якщо рік ділиться на 4 без остачі
			{
				if (y % 100 != 0 || (y % 100 == 0 && y % 400 == 0)) //якщо рік ділиться на 100 проте також ділться на 400
					cout << "Рік є високосним" << y << endl;


			}
		}
		catch (const char* msg) {
			cout << msg << endl;
		}
		return 0;
	}


}
int year(int y) {

	if (y < 0)
		throw "Помилка, не можливо обрахувати";
	else if (y > 10000)
		throw "Не можливо обрахувати, значення занадто велике";
}

